"""
Grade 1. Этап 2: Задание 1
"""

# добавляем слово при котором цикл завершается
stop_word = 'стоп'

# создаем пустой список и счетчик для удобства ввода
titles = []
count = 1

# начинаем цикл добавления заголовков
while True:
    new_title = input(f'Введите заголовок №{count} (оставьте пустым для завершения или введите "стоп"): ')
    new_title.strip()
    if new_title == 'стоп' or new_title == '':
        break
    titles.append(new_title)
    count += 1

# выводим полученный результат
if titles:
    print('Заголовки заметки: ')
    for i in titles:
        print(f'- {i}')
else:
    print('Список заголовк пуст!')

"""
Не понял что в конце написано:
7. Проверка статуса заметки
Добавьте функциональность для изменения status заметки на основе ввода пользователя.
Файл: update_status.py
"""