"""
Grade 1. Этап 2: Задание 2
"""

# Изначальный статус, предположим это изначальные данные
current_status = 'отложено'

# Предположим, что это беспконечный цикл, в соответствии с темой, чтобы показать возможности
while True:
    user_choice = input(f"""
    В настоящий момент статус заметки - {current_status}
        Вам предложено выбрать статус заметки:
        0. выход
        1. выполнено
        2. в процессе
        3. отложено
    Введите число предложенного варианта: """)
    user_choice = user_choice.strip()

    if user_choice == '0':
        'Вы вышли из меню изменения статуса заметки'
        break
    elif user_choice == '1':
        current_status = 'выполнено'
    elif user_choice == '2':
        current_status = 'в процессе'
    elif user_choice == '3':
        current_status = 'отложено'
    else:
        'Некорректный ввод, введите число в соответствии с предложенными ответами!'
        continue

    print(f'Статус заметки успешно обновлён на: {current_status}')
