"""
Grade 1. Этап 1: Задание 4
"""

# Создаем список для последующего добавления в него заголовков
titles = []

# Запрашиваем у пользователя названия заголовков и сохраняем их в переменные
title1 = input('Введите заголовок №1: ')
title2 = input('Введите заголовок №2: ')
title3 = input('Введите заголовок №3: ')

# Добавляем заголовки в список
titles.append(title1)
titles.append(title2)
titles.append(title3)

# Добавляем вывод всех переменных
print(titles)
# В задании не уточнено в каком виде нужно вывести переменные
# Возможно при помощи цикла
count = 0
for title in titles:
    count += 1
    print(f'Заголовок №{count}: {title}')
