"""
Grade 1. Этап 1: Задание 3
"""


# Устанавливаем переменные для использования текста при запросе ввода у пользователя
## Указанные переменные необходимо передавать при вызове функции input()
prompt_username = 'Пожалуйста, введите имя пользователя'
prompt_title = 'Пожалуйста, введите заголовок заметки'
prompt_content = 'Пожалуйста, введите описание заметки'
prompt_status = 'Пожалуйста, введите статус заметки'
## Необходимо внимательно относиться к указанному формату для ввода данных пользователем
prompt_created_date = (
    'Пожалуйста, введите дату создания заметки в формате "день-месяц-год", например "10-11-2024"'
)
prompt_issue_date = (
    'Пожалуйста, введите дату истечения заметки (дедлайн) в формате "день-месяц-год", например "10-12-2024"'
)

# Инициализируем переменные, запрашивая у пользователя информацию при помощи
username = input(prompt_username)
title = input(prompt_title)
content = input(prompt_content)
status = input(prompt_status)
created_date = input(prompt_created_date)
issue_date = input(prompt_issue_date)
