"""
Grade 1. Этап 2: Задание 1
"""

### Определяем переменные для работы скрипта ###
# переменная - слово для завершения цикла при вводе указанного значения
stopper = 'стоп'
# создаем пустой список
titles = []
# создаем счетчик для удобства ввода пользователем
count = 1
# просьба пользователю указать корректное значение
user_hint = 'Пожалуйста, введите корректное уникальное значение (не пустое и начинающееся с буквы)'

### Запускаем ввод значений пользователем ###
# запускаем цикл
# на каждой итерации запрашиваются у пользователя заголовки заметки
# пользователь может добавлять столько заголовков, сколько ему потребуется
# цикл завершается при вводе пользователем команды 'стоп' или пустого значения
while True:
    new_title: str = ''
    try:
        # создаем текст запроса на ввод заметки пользователем
        prompt_title = f'Введите заголовок № {count} (введите "стоп" для завершения): '
        # запрашиваем ввод у пользователя
        new_title = input(prompt_title)
        # форматируем значение полученное пользователем
        # убираем пробелы и приводим значение в нижний регистр
        new_title = new_title.strip().lower()
        # в случае если значение пустое, вызываем ошибку
        check1 = not new_title[0].isalpha()
        check2 = new_title in titles
        if check1 or check2:
            raise ValueError
    except ValueError:
        print(f'Ошибка ввода, {ValueError}. {user_hint}')
        continue
    except Exception as e:
        print(f'Произошла ошибка, {e}. {user_hint}')
        continue
    # производим проверку, на случай если пользователь хочет завершить ввод
    if new_title == stopper:
        count -= 1
        break
    # в случе если значение прошло проверку - добавляем заголовок в список и переходим на следующую итерацию
    titles.append(new_title)
    count += 1

### Запускаем вывод информации для пользователя ###
# после завершения цикла выводим полученный результат
if not titles:
    print('Список заголовков пуст')
else:
    print(f'Выводится список, состоящий из {count} заголовков: ')
    for title in titles:
        print('_' * 8)
        print(f'Заголовок № {titles.index(title) + 1}:')
        print(f'- {title}')
        print('_' * 8)
