"""
Grade 1. Этап 2: Задание 2
"""
from textwrap import dedent

### Вводим переменные для выполнения скрипта ###
# Изначальный статус, предположим это изначальные данные
note_status = {'status': 'Не установлено'}
current_status = note_status.get('status')

# запускаем бесконечный цикл
while True:
    # данную переменную запускаем, поскольку область видимости для форматирования строки нужна внутри цикла
    prompt_choice_status = dedent(f"""
        В настоящий момент статус заметки - "{current_status}"
        Вам предложено выбрать статус заметки:
        Выполнено - "1" или "выполнено"
        В процессе - "2" или "в процессе"
        Отложено - "3" или "отложено"
        Вы можете отменить выбор статуса, введя - "0" или "выход".
        Введите число предложенного варианта: """)
    ### Запрашиваем ввод у пользователя для изменения статуса заметки ###
    # запрашиваем ввод у пользователя отображая варианты и текущий статус заметки
    user_choice = input(prompt_choice_status)
    # форматируем ввод для дальнейшей проверки
    user_choice = user_choice.strip().lower()

    # проводим проверку ввода и изменяем в соответствии с вариантом
    if user_choice == '0' or user_choice == 'выход':
        print('Вы успешно вышли из меню изменения статуса заметки')
        break
    elif user_choice == '1' or user_choice == 'выполнено':
        current_status = 'выполнено'
    elif user_choice == '2' or user_choice == 'в процессе':
        current_status = 'в процессе'
    elif user_choice == '3' or user_choice == 'отложено':
        current_status = 'отложено'
    else:
        print('Некорректный ввод, пожалуйста, введите число в соответствии с предложенными ответами!')
        continue

    ### Работа с изменением данных и выводом пользователю ###
    # Вносим изменение в словарь и выводим информацию об изменении
    note_status['status'] = current_status
    print(f'Статус заметки успешно обновлён на: {current_status}')

