"""
Grade 1. Этап 1: Задание 2
"""

# Запрашиваем при помощи ввода дату у пользователя
day = input('Введите число: ')
month = input('Введите месяц (в виде слова): ')
year = input('Введите год: ')

# Сохраняем в виде переменных полученные значения для хранения и для вывода
date = f'{day} {month} {year}' # Для хранения в базе данных
temp_date = f'{day} {month}' # Для вывода

# Выводим переменную, предварительно отформатированную для вывода пользователю
print(temp_date)

"""
Я ввобще не понял задания по описанию, возможно нужно так: 
created_date = input('Введите дату создания заметки в формате "день-месяц-год", например "10-11-2024"')
temp_created_date = 'Измененная дата создания в формате "день-месяц"'
issue_date = input('Введите дату истечения заметки (дедлайн) в формате "день-месяц-год", например "10-11-2024"')
temp_issue_date = 'Измененная дата истечения в формате "день-месяц"'
print(temp_created_date)
print(temp_issue_date)
"""
