"""
Grade 1. Этап 1: Задание 1
"""

# В соответствии с описанием задачи создаем переменные и присваиваем им соответствующие значения
username = 'имя пользователя'
title = 'заголовок заметки'
content = 'описание заметки'
status = 'статус заметки'
created_date = 'дата создания заметки в формате "день-месяц-год", например "10-11-2024"'
issue_date = 'дата истечения заметки (дедлайн) в формате "день-месяц-год", например "10-12-2024"'

# Выводим результаты в формате print("Описание переменной:", переменная)
print(f'"{username}:", username')
print(f'"{title}:", title')
print(f'"{content}:", content')
print(f'"{status}:", status')
print(f'"{created_date}:", created_date')
print(f'"{issue_date}:", issue_date')
