"""
Grade 1. Этап 2: Задание 2
"""

# Изначальный статус, предположим это изначальные данные
abstract_dict = {'status': 'отложено'}
current_status = abstract_dict.get('status')

# Предположим, что это бесконечный цикл, в соответствии с темой, чтобы показать возможности
while True:
    # Запрашиваем ввод у пользователя отображая варианты и текущий статус заметки
    user_choice = input(f"""
    В настоящий момент статус заметки - {current_status}
        Вам предложено выбрать статус заметки:
        0. выход
        1. выполнено
        2. в процессе
        3. отложено
    Введите число предложенного варианта: """)

    # форматируем ввод для дальнейшей проверки, чтобы сделать ввод более удобным
    user_choice = user_choice.strip().lower()

    # Проводим проверку ввода и изменяем в соответствии с вариантом
    if user_choice == '0' or user_choice == 'выход':
        print('Вы вышли из меню изменения статуса заметки')
        break
    elif user_choice == '1' or user_choice == 'выполнено':
        current_status = 'выполнено'
    elif user_choice == '2' or user_choice == 'в процессе':
        current_status = 'в процессе'
    elif user_choice == '3' or user_choice == 'отложено':
        current_status = 'отложено'
    else:
        print('Некорректный ввод, введите число в соответствии с предложенными ответами!')
        continue

    # Вносим изменение в словарь и выводим информацию об изменении
    abstract_dict['status'] = current_status
    print(f'Статус заметки успешно обновлён на: {current_status}')
